Repository: loopnlearn/Loop
Catalog: WatchApp Extension/*.lproj/Localizable.strings
Languages: he

source: Active Carbs
he: פחמימות פעילות

source: Active Insulin
he: אינסולין פעיל

source: Add Carb Entry
he: הוסף ערך פחמימות

source: Bolus Failed
he: הבולוס נכשל

source: Dismiss
he: לבטל

source: Make sure your iPhone is nearby and try again
he: ודאו כי האייפון שלכם קרוב ונסו שנית

source: Send Failed
he: השליחה נכשלה

source: U
he: יח'

source: U/hr
he: יח/שעה

source: Workout
he: אימון
